{
  "nodes": [
    {
      "op": "null", 
      "name": "input_1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_layout_transform_27", 
      "attrs": {
        "func_name": "fused_layout_transform_27", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu", 
        "flatten_data": "0", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_4", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_4", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_max_pool2d_3", 
      "attrs": {
        "func_name": "fused_nn_max_pool2d_3", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_8", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_8", 
        "flatten_data": "0", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_max_pool2d_2", 
      "attrs": {
        "func_name": "fused_nn_max_pool2d_2", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_7", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_7", 
        "flatten_data": "0", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_1", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_1", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_max_pool2d_1", 
      "attrs": {
        "func_name": "fused_nn_max_pool2d_1", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_6", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_6", 
        "flatten_data": "0", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_2", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_2", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_max_pool2d", 
      "attrs": {
        "func_name": "fused_nn_max_pool2d", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_5", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_5", 
        "flatten_data": "0", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_3", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_3", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_upsampling_nn_pad_2", 
      "attrs": {
        "func_name": "fused_nn_upsampling_nn_pad_2", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
        "flatten_data": "0", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_concatenate_3", 
      "attrs": {
        "func_name": "fused_concatenate_3", 
        "flatten_data": "0", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          54, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_4", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_4", 
        "flatten_data": "0", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_21", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_2", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_upsampling_nn_pad_layout_transform", 
      "attrs": {
        "func_name": "fused_nn_upsampling_nn_pad_layout_transform", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
        "flatten_data": "0", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_concatenate_2", 
      "attrs": {
        "func_name": "fused_concatenate_2", 
        "flatten_data": "0", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          68, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_3", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_3", 
        "flatten_data": "0", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          69, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_11", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu_1", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_upsampling_nn_pad_1", 
      "attrs": {
        "func_name": "fused_nn_upsampling_nn_pad_1", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          78, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
        "flatten_data": "0", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_concatenate_1", 
      "attrs": {
        "func_name": "fused_concatenate_1", 
        "flatten_data": "0", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_2", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_2", 
        "flatten_data": "0", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu1", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ], 
        [
          90, 
          0, 
          0
        ], 
        [
          91, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_upsampling_nn_pad", 
      "attrs": {
        "func_name": "fused_nn_upsampling_nn_pad", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p63", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
        "flatten_data": "0", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          93, 
          0, 
          0
        ], 
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_concatenate", 
      "attrs": {
        "func_name": "fused_concatenate", 
        "flatten_data": "0", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          96, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p64", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p65", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p66", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
        "flatten_data": "0", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ], 
        [
          98, 
          0, 
          0
        ], 
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p67", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p68", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p69", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
        "flatten_data": "0", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          101, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ], 
        [
          103, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_layout_transform_26", 
      "attrs": {
        "func_name": "fused_layout_transform_26", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          105, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p70", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p71", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_NCHWc_add_sigmoid", 
      "attrs": {
        "func_name": "fused_nn_contrib_conv2d_NCHWc_add_sigmoid", 
        "flatten_data": "0", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          106, 
          0, 
          0
        ], 
        [
          107, 
          0, 
          0
        ], 
        [
          108, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_layout_transform_25", 
      "attrs": {
        "func_name": "fused_layout_transform_25", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          109, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    6, 
    7, 
    8, 
    9, 
    12, 
    13, 
    14, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    26, 
    27, 
    28, 
    29, 
    32, 
    33, 
    34, 
    36, 
    37, 
    38, 
    39, 
    42, 
    43, 
    44, 
    46, 
    47, 
    48, 
    49, 
    52, 
    53, 
    56, 
    57, 
    58, 
    60, 
    61, 
    62, 
    63, 
    66, 
    67, 
    70, 
    71, 
    72, 
    74, 
    75, 
    76, 
    77, 
    80, 
    81, 
    84, 
    85, 
    86, 
    88, 
    89, 
    90, 
    91, 
    94, 
    95, 
    98, 
    99, 
    100, 
    102, 
    103, 
    104, 
    107, 
    108
  ], 
  "heads": [
    [
      110, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        7, 
        8, 
        9, 
        1, 
        5, 
        10, 
        11, 
        12, 
        13, 
        14, 
        15, 
        16, 
        17, 
        5, 
        13, 
        18, 
        19, 
        20, 
        21, 
        22, 
        23, 
        24, 
        25, 
        13, 
        21, 
        26, 
        27, 
        28, 
        29, 
        30, 
        31, 
        32, 
        33, 
        21, 
        29, 
        34, 
        35, 
        36, 
        37, 
        38, 
        39, 
        40, 
        41, 
        29, 
        37, 
        42, 
        43, 
        29, 
        37, 
        44, 
        45, 
        46, 
        29, 
        47, 
        48, 
        49, 
        50, 
        21, 
        37, 
        51, 
        52, 
        21, 
        37, 
        53, 
        54, 
        55, 
        21, 
        56, 
        57, 
        58, 
        59, 
        13, 
        37, 
        60, 
        61, 
        13, 
        37, 
        62, 
        63, 
        64, 
        13, 
        65, 
        66, 
        67, 
        68, 
        5, 
        37, 
        69, 
        70, 
        5, 
        37, 
        71, 
        72, 
        73, 
        5, 
        74, 
        75, 
        76, 
        1, 
        5, 
        77, 
        78, 
        21, 
        13
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 1, 256, 256], 
        [1, 1, 256, 256, 1], 
        [1, 1, 3, 3, 1, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 256, 256, 5], 
        [1, 1, 3, 3, 5, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 256, 256, 5], 
        [1, 1, 128, 128, 5], 
        [2, 1, 3, 3, 5, 5], 
        [1, 2, 1, 1, 5], 
        [1, 2, 1, 1, 5], 
        [1, 2, 128, 128, 5], 
        [2, 2, 3, 3, 5, 5], 
        [1, 2, 1, 1, 5], 
        [1, 2, 1, 1, 5], 
        [1, 2, 1, 1, 5], 
        [1, 2, 128, 128, 5], 
        [1, 2, 64, 64, 5], 
        [4, 2, 3, 3, 5, 5], 
        [1, 4, 1, 1, 5], 
        [1, 4, 1, 1, 5], 
        [1, 4, 64, 64, 5], 
        [4, 4, 3, 3, 5, 5], 
        [1, 4, 1, 1, 5], 
        [1, 4, 1, 1, 5], 
        [1, 4, 1, 1, 5], 
        [1, 4, 64, 64, 5], 
        [1, 4, 32, 32, 5], 
        [5, 4, 3, 3, 5, 8], 
        [1, 5, 1, 1, 8], 
        [1, 5, 1, 1, 8], 
        [1, 5, 32, 32, 8], 
        [5, 5, 3, 3, 8, 8], 
        [1, 5, 1, 1, 8], 
        [1, 5, 1, 1, 8], 
        [1, 5, 1, 1, 8], 
        [1, 5, 32, 32, 8], 
        [1, 5, 16, 16, 8], 
        [10, 5, 3, 3, 8, 8], 
        [1, 10, 1, 1, 8], 
        [1, 10, 1, 1, 8], 
        [1, 10, 16, 16, 8], 
        [10, 10, 3, 3, 8, 8], 
        [1, 10, 1, 1, 8], 
        [1, 10, 1, 1, 8], 
        [1, 10, 1, 1, 8], 
        [1, 10, 16, 16, 8], 
        [1, 10, 33, 33, 8], 
        [5, 10, 2, 2, 8, 8], 
        [1, 5, 1, 1, 8], 
        [1, 5, 32, 32, 8], 
        [1, 10, 32, 32, 8], 
        [5, 10, 3, 3, 8, 8], 
        [1, 5, 1, 1, 8], 
        [1, 5, 1, 1, 8], 
        [1, 5, 32, 32, 8], 
        [5, 5, 3, 3, 8, 8], 
        [1, 5, 1, 1, 8], 
        [1, 5, 1, 1, 8], 
        [1, 5, 1, 1, 8], 
        [1, 5, 32, 32, 8], 
        [1, 8, 65, 65, 5], 
        [4, 8, 2, 2, 5, 5], 
        [1, 4, 1, 1, 5], 
        [1, 4, 64, 64, 5], 
        [1, 8, 64, 64, 5], 
        [4, 8, 3, 3, 5, 5], 
        [1, 4, 1, 1, 5], 
        [1, 4, 1, 1, 5], 
        [1, 4, 64, 64, 5], 
        [4, 4, 3, 3, 5, 5], 
        [1, 4, 1, 1, 5], 
        [1, 4, 1, 1, 5], 
        [1, 4, 1, 1, 5], 
        [1, 4, 64, 64, 5], 
        [1, 4, 129, 129, 5], 
        [2, 4, 2, 2, 5, 5], 
        [1, 2, 1, 1, 5], 
        [1, 2, 128, 128, 5], 
        [1, 4, 128, 128, 5], 
        [2, 4, 3, 3, 5, 5], 
        [1, 2, 1, 1, 5], 
        [1, 2, 1, 1, 5], 
        [1, 2, 128, 128, 5], 
        [2, 2, 3, 3, 5, 5], 
        [1, 2, 1, 1, 5], 
        [1, 2, 1, 1, 5], 
        [1, 2, 1, 1, 5], 
        [1, 2, 128, 128, 5], 
        [1, 2, 257, 257, 5], 
        [1, 2, 2, 2, 5, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 256, 256, 5], 
        [1, 2, 256, 256, 5], 
        [1, 2, 3, 3, 5, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 256, 256, 5], 
        [1, 1, 3, 3, 5, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 1, 1, 5], 
        [1, 1, 256, 256, 5], 
        [1, 5, 256, 256, 1], 
        [1, 5, 1, 1, 1, 1], 
        [1, 1, 1, 1, 1], 
        [1, 1, 256, 256, 1], 
        [1, 1, 256, 256]
      ]
    ], 
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111
  ]
}